app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.find_by_id(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 2]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      if Song.find_by_id(params[:id]) && Song.find_by_id(params[:id]).artist == Artist.find_by_id(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 2], ["id", 5], ["LIMIT", 1]]